# Библиотека Pandas

## DataFrame и Serries

pandas.DataFrame(data=None, index=None, columns=None, dtype=None, copy=None)

pandas.Series(data=None, index=None, dtype=None, name=None, copy=False)

In [1]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

Создаем произвольный массив

In [2]:
table = np.array((range(4,-3, -2), np.random.choice(range(100), size=4, replace=False)))
table

array([[ 4,  2,  0, -2],
       [97, 36, 94, 22]])

Выбираем произвольную ячейку...

In [3]:
table[1][2]

94

...либо строку целиком

In [4]:
table[0]

array([ 4,  2,  0, -2])

Такая структура простая и понятная, но недостаточно удобная. Например, затруднительно выделять столбецы.


Также на больших объемах данных быстродействие может оказаться недостаточным.

Этих недостатков лишена библиотека Pandas

В pandas реализованы типы данных с разным числом измерений: одномерный тип (просто ряд) называется Series, двумерный (табличка) — DataFrame, трёхмерный — Panel (здесь не рассматриваем).  

Преобразуем массив в DataFrame:

In [5]:
df = pd.DataFrame(table)
df

    0   1   2   3
0   4   2   0  -2
1  97  36  94  22

У такой таблицы можно обращаться к строкам, а можно и к столбцам:

In [6]:
df[1] # ВТОРОЙ столбец

0     2
1    36
Name: 1, dtype: int64

... и по строкам

In [7]:
df.loc[0] # первая строка

0    4
1    2
2    0
3   -2
Name: 0, dtype: int64

И всё  вместе:

In [8]:
df[1].loc[0]

2

## Загрузка датафрейма из CSV-файла
Рассмотрим простой CSV-файл с данными, изображающими результаты нескольких виртуальных студентов по некоторым тестам.

In [9]:
df = pd.read_csv("pandas_exsample.csv")
df

          Предмет  Аня  Петя  Клава  Гриша
0         Алгебра  1.0   2.0    3.0    2.0
1         English  2.3   1.2    3.2    1.2
2      Литература  2.1   2.3    2.3    2.2
3     Физкультура  4.0   2.5    2.4    1.2
4  Обществознание  6.0   5.0    4.0    5.0

In [10]:
df.Аня

0    1.0
1    2.3
2    2.1
3    4.0
4    6.0
Name: Аня, dtype: float64

In [11]:
df["Аня"]

0    1.0
1    2.3
2    2.1
3    4.0
4    6.0
Name: Аня, dtype: float64

Переразгружаем файл и делаем столбец с предметами индексным

In [12]:
df = pd.read_csv("pandas_exsample.csv", index_col=0)
df

                Аня  Петя  Клава  Гриша
Предмет
Алгебра         1.0   2.0    3.0    2.0
English         2.3   1.2    3.2    1.2
Литература      2.1   2.3    2.3    2.2
Физкультура     4.0   2.5    2.4    1.2
Обществознание  6.0   5.0    4.0    5.0

In [13]:
df.loc['Физкультура']

Аня      4.0
Петя     2.5
Клава    2.4
Гриша    1.2
Name: Физкультура, dtype: float64

Строка датафрейма называется «наблюдением» (observation), а столбец — «переменной» (variable). Данные в столбце должны быть однородны (т.е. может быть столбец, состоящий только из чисел или только из строк, но не может быть столбца, в котором перемешаны строки и числа), а по строкам данные могут быть разнородны.

In [14]:
df.index

Index(['Алгебра', 'English', 'Литература', 'Физкультура', 'Обществознание'], dtype='object', name='Предмет')

Не если не хотим видеть имя столбца индексов

In [15]:
df.index.name = None
df.index

Index(['Алгебра', 'English', 'Литература', 'Физкультура', 'Обществознание'], dtype='object')

Клава хочет быть переименованной в Клавдию

In [16]:
print (df.columns)

df.rename(columns={'Клава': 'Клавдия'}, inplace=True)

df.columns

Index(['Аня', 'Петя', 'Клава', 'Гриша'], dtype='object')

Index(['Аня', 'Петя', 'Клавдия', 'Гриша'], dtype='object')

Или поменять 'English' на "Английский язык"

In [17]:
print (df.index)

df.rename(index={'English' : "Английский язык"}, inplace=True)

df.index

Index(['Алгебра', 'English', 'Литература', 'Физкультура', 'Обществознание'], dtype='object')

Index(['Алгебра', 'Английский язык', 'Литература', 'Физкультура',
       'Обществознание'],
      dtype='object')

## Срезы
Несмотря на то, что просто квадратные скобки (безо всяких .loc перед ними) позволяют обращаться к столбцам таблицы, те же самые квадратные скобки, используемые вместе со срезами, работают «по строчкам». Например, вот так можно получить вторую и третью строчки таблицы:

In [18]:
df[1:4]

                 Аня  Петя  Клавдия  Гриша
Английский язык  2.3   1.2      3.2    1.2
Литература       2.1   2.3      2.3    2.2
Физкультура      4.0   2.5      2.4    1.2

In [19]:
df['Английский язык':'Физкультура']

                 Аня  Петя  Клавдия  Гриша
Английский язык  2.3   1.2      3.2    1.2
Литература       2.1   2.3      2.3    2.2
Физкультура      4.0   2.5      2.4    1.2

In [20]:
df[['Аня', 'Клавдия']]

                 Аня  Клавдия
Алгебра          1.0      3.0
Английский язык  2.3      3.2
Литература       2.1      2.3
Физкультура      4.0      2.4
Обществознание   6.0      4.0

А вот так можно с помощью loc[] получить столбец:

In [21]:
df.loc[:, 'Клавдия']

Алгебра            3.0
Английский язык    3.2
Литература         2.3
Физкультура        2.4
Обществознание     4.0
Name: Клавдия, dtype: float64

## iloc[  ]
Метод loc[  ] работает с именами строк и столбцов, а если нужно использовать их номера, то вызывается метод iloc[  ]

In [22]:
df.iloc[1] # вторая строка

Аня        2.3
Петя       1.2
Клавдия    3.2
Гриша      1.2
Name: Английский язык, dtype: float64

In [23]:
df.iloc[:, 2] # третий столбец

Алгебра            3.0
Английский язык    3.2
Литература         2.3
Физкультура        2.4
Обществознание     4.0
Name: Клавдия, dtype: float64

In [24]:
df.iloc[1, 2] # ячейка во второй строке, третьем столбце

3.2

## at[  ] и iat[  ]
Обычные квадратные скобки, а также методы loc[  ] и iloc[  ] относительно медленные. Для быстрого обращения к конкретной ячейке используются методы at[] или iat[].

In [25]:
df.at['Литература', 'Аня']

2.1

In [26]:
df.iat[2, 0]

2.1

## Выбор по условию
Предположим, что нам нужно получить все строки, соответствующие тестам, по которым Аня получила оценку выше тройки.

In [27]:
df[df['Аня']>3]

                Аня  Петя  Клавдия  Гриша
Физкультура     4.0   2.5      2.4    1.2
Обществознание  6.0   5.0      4.0    5.0

Этот синтаксис работает примерно так же, как аналогичный синтаксис в np.array. Результатом сравнения df['Ann'] с числом 3 является  pd.Series булевских элементов, являющиеся результатами попарного сравнения элементов df['Ann'] с числом 3

In [28]:
df['Аня']>3

Алгебра            False
Английский язык    False
Литература         False
Физкультура         True
Обществознание      True
Name: Аня, dtype: bool

In [29]:
df.loc[:, df.loc['Английский язык']>2] 
# выбрать все столбцы, у которых в строке `EАнглийский язык` оценка больше двух

                 Аня  Клавдия
Алгебра          1.0      3.0
Английский язык  2.3      3.2
Литература       2.1      2.3
Физкультура      4.0      2.4
Обществознание   6.0      4.0

In [30]:
df[ (df['Аня'] > 1) & (df['Гриша'] >= 2) ]

                Аня  Петя  Клавдия  Гриша
Литература      2.1   2.3      2.3    2.2
Обществознание  6.0   5.0      4.0    5.0

In [31]:
df.query('Аня > 1 and Гриша >= 2')

                Аня  Петя  Клавдия  Гриша
Литература      2.1   2.3      2.3    2.2
Обществознание  6.0   5.0      4.0    5.0

## Мультииндекс

In [32]:
index = [('California', 2000), ('California', 2010),
         ('New York', 2000), ('New York', 2010),
         ('Texas', 2000), ('Texas', 2010)]
populations = [33871648, 37253956,
               18976457, 19378102,
               20851820, 25145561]
ds = pd.Series(populations, index=index)
ds

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [33]:
index = pd.MultiIndex.from_tuples(index)
index

MultiIndex([('California', 2000),
            ('California', 2010),
            (  'New York', 2000),
            (  'New York', 2010),
            (     'Texas', 2000),
            (     'Texas', 2010)],
           )

In [34]:
ds = ds.reindex(index)

ds

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [35]:
ds[:,2010]

California    37253956
New York      19378102
Texas         25145561
dtype: int64

In [36]:
ds['New York']

2000    18976457
2010    19378102
dtype: int64

In [37]:
ds[:,2000]['New York'] # не изящно

18976457

In [38]:
pop_ds = ds.unstack()
pop_ds

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [39]:
pop_ds.stack()

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [40]:
pop_df = pd.DataFrame({'total': ds,
                       'under18': [9267089, 9284094,
                                   4687374, 4318033,
                                   5906301, 6879014]})
pop_df

                    total  under18
California 2000  33871648  9267089
           2010  37253956  9284094
New York   2000  18976457  4687374
           2010  19378102  4318033
Texas      2000  20851820  5906301
           2010  25145561  6879014

In [41]:
f_u18 = pop_df['under18'] / pop_df['total']
f_u18.unstack()

                2000      2010
California  0.273594  0.249211
New York    0.247010  0.222831
Texas       0.283251  0.273568

In [42]:
# hierarchical indices and columns
index = pd.MultiIndex.from_product([[2019, 2020], [1, 2]],
                                   names=['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],
                                     names=['subject', 'type'])

# mock some data
data = np.round(np.random.randn(4, 6), 1)
data[:, ::2] *= 10
data += 57

# create the DataFrame
health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2019 1      50.0  58.0  42.0  56.2  66.0  56.7
     2      61.0  57.5  55.0  57.7  69.0  56.7
2020 1      46.0  57.2  65.0  58.2  56.0  56.7
     2      49.0  56.9  47.0  56.2  36.0  57.1

In [43]:
health_data['Guido']

type          HR  Temp
year visit
2019 1      42.0  56.2
     2      55.0  57.7
2020 1      65.0  58.2
     2      47.0  56.2

In [44]:
health_data['Guido', 'HR']

year  visit
2019  1        42.0
      2        55.0
2020  1        65.0
      2        47.0
Name: (Guido, HR), dtype: float64

In [45]:
health_data.iloc[:2, :2]

subject      Bob
type          HR  Temp
year visit
2019 1      50.0  58.0
     2      61.0  57.5

In [46]:
health_data.loc[:, ('Bob', 'HR')]

year  visit
2019  1        50.0
      2        61.0
2020  1        46.0
      2        49.0
Name: (Bob, HR), dtype: float64

In [47]:
idx = pd.IndexSlice
health_data.loc[idx[:, 1], idx[:, 'HR']]

subject      Bob Guido   Sue
type          HR    HR    HR
year visit
2019 1      50.0  42.0  66.0
2020 1      46.0  65.0  56.0

In [48]:
health_data.to_excel("health_data.xls")

## Альтернативы Multy Index

### вернемся к табелю успеваемости

In [49]:
df

                 Аня  Петя  Клавдия  Гриша
Алгебра          1.0   2.0      3.0    2.0
Английский язык  2.3   1.2      3.2    1.2
Литература       2.1   2.3      2.3    2.2
Физкультура      4.0   2.5      2.4    1.2
Обществознание   6.0   5.0      4.0    5.0

### добавим еще строку и колонку

In [50]:
new_index = list(df.index)
new_index.append('Физика')
new_index

['Алгебра',
 'Английский язык',
 'Литература',
 'Физкультура',
 'Обществознание',
 'Физика']

In [51]:
df = df.append({'Аня':2.3, 'Петя':2.2, 'Клавдия':4.5, 'Гриша':1.9}, ignore_index=True)
df

   Аня  Петя  Клавдия  Гриша
0  1.0   2.0      3.0    2.0
1  2.3   1.2      3.2    1.2
2  2.1   2.3      2.3    2.2
3  4.0   2.5      2.4    1.2
4  6.0   5.0      4.0    5.0
5  2.3   2.2      4.5    1.9

In [52]:
df.index = new_index

In [53]:
df["Направление"] = ["Техническое", "Гуманитарное", "Гуманитарное", "Гуманитарное","Гуманитарное","Техническое"]
df

                 Аня  Петя  Клавдия  Гриша   Направление
Алгебра          1.0   2.0      3.0    2.0   Техническое
Английский язык  2.3   1.2      3.2    1.2  Гуманитарное
Литература       2.1   2.3      2.3    2.2  Гуманитарное
Физкультура      4.0   2.5      2.4    1.2  Гуманитарное
Обществознание   6.0   5.0      4.0    5.0  Гуманитарное
Физика           2.3   2.2      4.5    1.9   Техническое

### pandas.pivot(data, index=None, columns=None, values=None)
#### _Возвращает измененный DataFrame, организованный по заданным значениям индекса/столбца._

In [54]:
df_pivot = df.pivot( columns='Направление', values=['Аня','Петя', 'Клавдия', 'Гриша']) 
# index = df.index
df_pivot

                         Аня                     Петя              \
Направление     Гуманитарное Техническое Гуманитарное Техническое
Алгебра                  NaN         1.0          NaN         2.0
Английский язык          2.3         NaN          1.2         NaN
Литература               2.1         NaN          2.3         NaN
Обществознание           6.0         NaN          5.0         NaN
Физика                   NaN         2.3          NaN         2.2
Физкультура              4.0         NaN          2.5         NaN

                     Клавдия                    Гриша
Направление     Гуманитарное Техническое Гуманитарное Техническое
Алгебра                  NaN         3.0          NaN         2.0
Английский язык          3.2         NaN          1.2         NaN
Литература               2.3         NaN          2.2         NaN
Обществознание           4.0         NaN          5.0         NaN
Физика                   NaN         4.5          NaN         1.9
Физкультура              2.4         NaN          1.2         NaN

In [55]:
df_pivot.columns

MultiIndex([(    'Аня', 'Гуманитарное'),
            (    'Аня',  'Техническое'),
            (   'Петя', 'Гуманитарное'),
            (   'Петя',  'Техническое'),
            ('Клавдия', 'Гуманитарное'),
            ('Клавдия',  'Техническое'),
            (  'Гриша', 'Гуманитарное'),
            (  'Гриша',  'Техническое')],
           names=[None, 'Направление'])

### pandas.pivot_table(data, values=None, index=None, columns=None, aggfunc='mean', fill_value=None, margins=False, dropna=True, margins_name='All', observed=False, sort=True)
#### _Создается сводная таблицу в стиле электронной таблицы как DataFrame._

In [56]:
df_pivot_table = pd.pivot_table(df,  columns='Направление', values=['Аня','Петя', 'Клавдия', 'Гриша'],
                    aggfunc={'Аня': np.mean,
                             'Петя': np.mean,
                             'Клавдия': np.mean,
                             'Гриша': np.mean
                            })
df_pivot_table

Направление  Гуманитарное  Техническое
Аня                 3.600         1.65
Гриша               2.400         1.95
Клавдия             2.975         3.75
Петя                2.750         2.10

In [57]:
df_pivot_table.columns

Index(['Гуманитарное', 'Техническое'], dtype='object', name='Направление')

In [58]:
df_pivot_table = pd.pivot_table(df,  columns='Направление', values=['Аня','Петя', 'Клавдия', 'Гриша'],
                    aggfunc={'Аня': np.min,
                             'Петя': np.min,
                             'Клавдия': np.min,
                             'Гриша': np.min
                            })
df_pivot_table

Направление  Гуманитарное  Техническое
Аня                   2.1          1.0
Гриша                 1.2          1.9
Клавдия               2.3          3.0
Петя                  1.2          2.0